#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

random_id.lambda_functions_bucket_name: Refreshing state... [id=6_7XO5h5BjE]
aws_iam_role.auth_execution_role: Refreshing state... [id=auth-lambda-execution-role-dev]
module.dynamodb_table_users.aws_dynamodb_table.dynamoTable: Refreshing state... [id=users-dev]
module.lambda_login.aws_iam_role.lambda_execution_role: Refreshing state... [id=loginFunction-lambda-execution-role-dev]
module.lambda_cidr_to_mask.aws_iam_role.lambda_execution_role: Refreshing state... [id=cidrToMaskFunction-lambda-execution-role-dev]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/dev/sre-bootcamp-api]
module.lambda_register.aws_iam_role.lambda_execution_role: Refreshing state... [id=registerFunction-lambda-execution-role-dev]
aws_apigatewayv2_api.main: Refreshing state... [id=1eg4cbk1ol]
module.lambda_health.aws_iam_role.lambda_execution_role: Refreshing state... [id=healthFunction-lambda-execution-role-dev]
module.lambda_root.aws_iam_role.lambda_execution_role: Refreshing state... [id=rootFunction-lambda-execution-role-dev]
module.s3_bucket_for_lambda.aws_s3_bucket.bucket: Refreshing state... [id=sre-bootcamp-functions-bucketebfed73b98790631-dev]
module.lambda_cidr_to_mask.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=cidrToMaskFunction-lambda-execution-role-dev-20230330090853910600000006]
module.lambda_mask_to_cidr.aws_iam_role.lambda_execution_role: Refreshing state... [id=maskToCidrFunction-lambda-execution-role-dev]
aws_iam_role_policy_attachment.lambda_auth_policies_attachment["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"]: Refreshing state... [id=auth-lambda-execution-role-dev-20230330090853815400000003]
aws_iam_role_policy_attachment.lambda_auth_policies_attachment["arn:aws:iam::408257009451:policy/jwtSecret_Policy"]: Refreshing state... [id=auth-lambda-execution-role-dev-20230330090853820500000004]
aws_iam_role_policy_attachment.lambda_auth_policies_attachment["arn:aws:iam::aws:policy/SecretsManagerReadWrite"]: Refreshing state... [id=auth-lambda-execution-role-dev-20230330090853852200000005]
module.lambda_root.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=rootFunction-lambda-execution-role-dev-20230330090853791400000002]
module.lambda_health.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=healthFunction-lambda-execution-role-dev-20230330090854158400000007]
aws_iam_policy.dynamoDbLambdaPolicy: Refreshing state... [id=arn:aws:iam::408257009451:policy/dynamoDbLambdaPolicy-dev]
aws_cloudwatch_log_group.main_api_gw: Refreshing state... [id=/aws/api-gw/sre-bootcamp-api-dev]
aws_apigatewayv2_stage.stage: Refreshing state... [id=dev]
module.lambda_mask_to_cidr.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=maskToCidrFunction-lambda-execution-role-dev-20230330090853786900000001]
module.lambda_register.aws_iam_role_policy_attachment.lambda_execution_role_policies[1]: Refreshing state... [id=registerFunction-lambda-execution-role-dev-2023033009090115720000000a]
module.lambda_register.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=registerFunction-lambda-execution-role-dev-20230330090901125500000009]
module.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[1]: Refreshing state... [id=loginFunction-lambda-execution-role-dev-2023033009090138840000000d]
module.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[2]: Refreshing state... [id=loginFunction-lambda-execution-role-dev-2023033009090138800000000c]
module.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[3]: Refreshing state... [id=loginFunction-lambda-execution-role-dev-20230330090901122300000008]
module.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=loginFunction-lambda-execution-role-dev-2023033009090134800000000b]
module.lambda_cidr_to_mask.aws_s3_object.lambda_code: Refreshing state... [id=cidrToMaskFunction-dev/app.zip]
module.s3_bucket_for_lambda.aws_s3_bucket_server_side_encryption_configuration.bucket_encryption: Refreshing state... [id=sre-bootcamp-functions-bucketebfed73b98790631-dev]
module.lambda_root.aws_s3_object.lambda_code: Refreshing state... [id=rootFunction-dev/app.zip]
module.lambda_login.aws_s3_object.lambda_code: Refreshing state... [id=loginFunction-dev/app.zip]
module.lambda_register.aws_s3_object.lambda_code: Refreshing state... [id=registerFunction-dev/app.zip]
aws_s3_object.lambda_auth_code: Refreshing state... [id=authFunction-dev/app.zip]
module.s3_bucket_for_lambda.aws_s3_bucket_versioning.bucket_versioning: Refreshing state... [id=sre-bootcamp-functions-bucketebfed73b98790631-dev]
module.lambda_mask_to_cidr.aws_s3_object.lambda_code: Refreshing state... [id=maskToCidrFunction-dev/app.zip]
module.lambda_health.aws_s3_object.lambda_code: Refreshing state... [id=healthFunction-dev/app.zip]
module.lambda_register.aws_lambda_function.function: Refreshing state... [id=registerFunction-dev]
module.lambda_mask_to_cidr.aws_lambda_function.function: Refreshing state... [id=maskToCidrFunction-dev]
aws_lambda_function.lambda_authorizer_function: Refreshing state... [id=authFunction-dev]
module.lambda_cidr_to_mask.aws_lambda_function.function: Refreshing state... [id=cidrToMaskFunction-dev]
module.lambda_root.aws_lambda_function.function: Refreshing state... [id=rootFunction-dev]
module.lambda_login.aws_lambda_function.function: Refreshing state... [id=loginFunction-dev]
module.lambda_health.aws_lambda_function.function: Refreshing state... [id=healthFunction-dev]
aws_apigatewayv2_authorizer.authorizer: Refreshing state... [id=r2fuq6]
aws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_mask_to_cidr.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_mask_to_cidr.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=4j5jtb4]
module.lambda_cidr_to_mask.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_cidr_to_mask.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=ioua535]
module.lambda_health.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_health.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=18z3zim]
module.lambda_root.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_root.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=i8itis6]
module.lambda_login.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_register.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_register.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=2zl9c88]
module.lambda_login.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=tuzkr9u]
aws_apigatewayv2_deployment.deployment: Refreshing state... [id=sbmhlx]
module.lambda_mask_to_cidr.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=ln0prfn]
module.lambda_cidr_to_mask.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=xx7ypds]
module.lambda_health.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=n2ulxds]
module.lambda_login.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=6269rkj]
module.lambda_root.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=2gj4ln5]
module.lambda_register.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=373bl73]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_deployment.deployment must be replaced
-/+ resource "aws_apigatewayv2_deployment" "deployment" {
      ~ auto_deployed = false -> (known after apply)
      ~ id            = "sbmhlx" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "5728fcfe7d72fc8b2d852ed851c43c8adc49f551"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.lambda_authorizer_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_authorizer_function" {
        id                             = "authFunction-dev"
      ~ last_modified                  = "2023-03-30T16:52:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "EbBy2IEohmBNmRVYkgzu1ZhblaVoMwdGg6sU94zkI6I=" -> "cZPaXkzG4Dx6eLmPGjjRLAfRtJxHeEm2nEYnW7HwxqM="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.lambda_auth_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_auth_code" {
      ~ etag                   = "cbf871ae89d3137df6b8724271c0ee19" -> "25f1ed66a40b6358804d91c50fa80a8b"
        id                     = "authFunction-dev/app.zip"
        tags                   = {}
      ~ version_id             = "zxLDzyv06H70PphWQoSmM_.e7ZBrVK41" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_cidr_to_mask.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "cidrToMaskFunction-dev"
      ~ last_modified                  = "2023-03-30T16:52:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:cidrToMaskFunction-dev:26" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:cidrToMaskFunction-dev:26/invocations" -> (known after apply)
      ~ source_code_hash               = "mFdAENP4kZuGUFqYrQ5p57UXMQ4gl9IK3KqER5ACn2E=" -> "0n9zEsa39YP7mPVfRIU3HxtHmAeyah+4lSwyiGpoi6I="
        tags                           = {}
      ~ version                        = "26" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_cidr_to_mask.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "308b3424db6ad094693168b0da66ccd1" -> "8c5a6798b3e80c236bd58b247dc06662"
        id                     = "cidrToMaskFunction-dev/app.zip"
        tags                   = {}
      ~ version_id             = "tT_7A5.Ox_AHgj27VpNHsnA177jGLvoO" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_health.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "healthFunction-dev"
      ~ last_modified                  = "2023-03-30T16:52:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:healthFunction-dev:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:healthFunction-dev:21/invocations" -> (known after apply)
      ~ source_code_hash               = "p+JHWByYvQ3APwr+G3xvDuq5tLfG5Ri3CmzvFd62BeA=" -> "PFpbxUelSzgLKpRPZzggUlzAjBG/XuTp1VVdM0IeQX0="
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_health.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "63728434bfa807a56724b214b5833c96" -> "efc4f22001aa4a4d821bd49472d75790"
        id                     = "healthFunction-dev/app.zip"
        tags                   = {}
      ~ version_id             = "5kFAhYGEa7FF2GslWTdw7JVdYhTtybsl" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_login.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "loginFunction-dev"
      ~ last_modified                  = "2023-03-30T16:52:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:loginFunction-dev:25" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:loginFunction-dev:25/invocations" -> (known after apply)
      ~ source_code_hash               = "zhsdx83aLKxruf96wnygfxKSuoUDQzBh0+gfZ9rMicU=" -> "NVo3P9X7ztzr4y4hqJ2ovm6E9Z3XsjtPSvzBn0+/j2Q="
        tags                           = {}
      ~ version                        = "25" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_login.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "d8ce58986f7590f8148da3a17710ebff" -> "8ac935f38c12671f107957fa7c144a39"
        id                     = "loginFunction-dev/app.zip"
        tags                   = {}
      ~ version_id             = "hsYVCv1YnpjqZdpXC42CK.7ZU4d0Tzzv" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_mask_to_cidr.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "maskToCidrFunction-dev"
      ~ last_modified                  = "2023-03-30T16:52:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:maskToCidrFunction-dev:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:maskToCidrFunction-dev:21/invocations" -> (known after apply)
      ~ source_code_hash               = "d44jQpV43erZ+jZ2jNg4tGKrAbkt08WZBGmVOxHjf+Q=" -> "pelOQCZu1Ni8S+d0tk+l6ZHH5Yod1BvapDE2Ws4ZV28="
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_mask_to_cidr.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "7a4709321ee7da7679b1749efbf500fe" -> "a646416f37db5441d0eed71eb7b98c55"
        id                     = "maskToCidrFunction-dev/app.zip"
        tags                   = {}
      ~ version_id             = "ciiJHjiJOqHBNDc.4E5ho9uQdfnHzh0k" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_register.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "registerFunction-dev"
      ~ last_modified                  = "2023-03-30T16:52:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:registerFunction-dev:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:registerFunction-dev:21/invocations" -> (known after apply)
      ~ source_code_hash               = "hwQKn0cp7z/K/Kotjw7XibIpBgC7jKviJu53069AR/c=" -> "58rk7LAqGhRRUcAvQYGVmMGccFIPNhlrBUKxHzOwhnE="
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_register.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "8a9f4998370829c795fe05c559f72bac" -> "2f8d5048d03344e931c7e2cecce7d9f8"
        id                     = "registerFunction-dev/app.zip"
        tags                   = {}
      ~ version_id             = "RlgYrLMXz9sMoZkX8LKyUOZ3YKuW7km3" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_root.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "rootFunction-dev"
      ~ last_modified                  = "2023-03-30T16:52:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:rootFunction-dev:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:rootFunction-dev:21/invocations" -> (known after apply)
      ~ source_code_hash               = "pW/EwhHggTXRhLu8lpgn3UHrAqN44lCuMFCgCHXS1V0=" -> "Eq/0JaJfwwY09ZroEM4kvaKuM/vlinq9Kyu7hhIuyEU="
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_root.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "739ea942cfb7190805668a237192ba5a" -> "234992ea55d4a57a30d9b37cbf4e8d4e"
        id                     = "rootFunction-dev/app.zip"
        tags                   = {}
      ~ version_id             = "bT5xHFCqE4qmJ9mdbnRaj9m_OcX0B43L" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 14 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @trujillo9616, Action: `pull_request`*